app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "I love posting on my blog!"], ["created_at", Mon, 01 Apr 2013 20:25:39 UTC +00:00], ["name", "Sloane"], ["title", "First Post"], ["updated_at", Mon, 01 Apr 2013 20:25:39 UTC +00:00]]

  def update
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]